MT/cfd_sim/cases/case0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,A)      Gauss linearUpwind grad(A);
    div(phi,B)      Gauss linearUpwind grad(B);
    div(phi,U)      Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
    div((nuEff*dev2(A(grad(U)))))  Gauss linear;
    div((nuEff*dev2(B(grad(U)))))  Gauss linear;
    div((nuM*grad(U)))          Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
